Tekla Open API Reference for Tekla Structures 2025
ModelHistory.GetModifications Method (String, IEnumerable<ModelObject.ModelObjectEnum>, ModificationStamp)
Lookup modifications since previous call of TakeModifications() without resetting the modstamp, with object type filtering
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static ModificationInfo GetModifications(
	string Name,
	IEnumerable<ModelObject.ModelObjectEnum> ObjectTypes,
	ModificationStamp PrevStamp = null
)
Public Shared Function GetModifications (
	Name As String,
	ObjectTypes As IEnumerable(Of ModelObject.ModelObjectEnum),
	Optional PrevStamp As ModificationStamp = Nothing
) As ModificationInfo
Parameters
Name
Type: System.String
Name of reference which is used for collecting modifications and which is updated. Intended use is to assign an unique name for each client application which needs to be informed of the model updates. Maximum length is 79 characters.
ObjectTypes
Type: System.Collections.Generic.IEnumerable<ModelObject.ModelObjectEnum>
Types of object to select. Empty or null selects all types.
PrevStamp (Optional)
Type: Tekla.Structures.Model.History.ModificationStamp
When specified, default value of reference if is it not found
Return Value
Type: ModificationInfo
All modifications which happened since the last call
Remarks
Same as GetModifications(String, ModificationStamp), but returns only the types listed in ObjectTypes.
See Also
Reference
ModelHistory Class
GetModifications Overload
Tekla.Structures.Model.History Namespace